package kioskProject;

public class Kiosk {

  public static void main(String[] args) {
    // TODO Auto-generated method stub
int a;
System.out.println(a);


  }

}



//

//
//일단 음식을
//골라서 결제하는 로직을 만들고'늘먹던걸로'
//메뉴를 만들자
//
//---1. 메뉴선택 2. 멤버십입력 3. 종료+@.외국어
//
//1)
//누를 수
//있는 선택지 메뉴 1~8개 (배열은 넉넉하게 둔다)
//
//결제하기 > 결제수단선택
//취소하기(메뉴)
//메인화면으로 돌아가기
//+멤버십입력
//
//+같은 메뉴를 세 번 이상 선택하면 즐겨찾기로 추가할 거냐는 선택지가 나타난다.
//선택지에 추가하면 멤버십입력 다음으로 넘어갈 때 즐겨찾기 존재유무를 확인하고
//있을 경우 고른 메뉴에 미리 추가한다.
////메뉴를 배열로 만들어서 보여주는 기능 필요
//다른 메뉴를 선택할 경우 즐겨찾기로 추가해둔 메뉴는 전부 사라진다.
//
//
//2)
//QR코드 or 핸드폰번호 입력받는 sc.nextInt
//
//
